Enums/кб99_СтатусЗапроса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>кб99_СтатусЗапроса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>COMPLETED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>REJECTED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IN_PROCESS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ACCEPTED</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВСД2_КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_КорректировкаРеализации</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВСДКАннулированию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВСДКГашению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусВСД</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_СтатусВСД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОформленныеКорректировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВСД2_транзакция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВСД2_транзакция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ВетИС_КлиентскийСлойКлиент/Ext/Module.bsl
// GRACE:MODULE_START name="ВетИС_КлиентскийСлойКлиент"
// @grace-module: ВетИС_КлиентскийСлойКлиент
// @grace-purpose: Клиентские обёртки форм ВетИС: подтверждения, открытие форм, UI-логика на клиенте
// @grace-depends: ВетИС_ЯдроСервер, ВетИС_УтилитыКлиентСервер, ВетИС_APIСервер, ВетИС_ПроизводствоСервер
// @grace-version: 2.0
// @grace-contract-ref: docs/Contracts.xml -> module="ВетИС_КлиентскийСлойКлиент"
// GRACE:DEPENDENCY target="кб99_ВСД"
// GRACE:DEPENDENCY target="ВетИС_УтилитыКлиентСервер"
// GRACE:DEPENDENCY target="ВетИС_APIСервер"
// GRACE:DEPENDENCY target="ВетИС_ПроизводствоСервер"

// GRACE:CONTRACT function="ПоказатьПодтверждениеЗакрытияФормы"
Процедура ПоказатьПодтверждениеЗакрытияФормы(
		Знач ОповещениеСохранитьИЗакрыть, 
		Отказ, 
		Знач ЗавершениеРаботы, 
		Знач ТекстПредупреждения = "", 
		ТекстПредупрежденияПриЗавершении = Неопределено) Экспорт

	Форма = ОповещениеСохранитьИЗакрыть.Модуль;
	Если Не Форма.Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если ЗавершениеРаботы Тогда
		Если ТекстПредупрежденияПриЗавершении = "" Тогда // передан параметр из ПередЗакрытием
			ТекстПредупрежденияПриЗавершении = НСтр("ru = 'Данные были изменены. Все изменения будут потеряны.'");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры = Новый Структура();
	Параметры.Вставить("ОповещениеСохранитьИЗакрыть", ОповещениеСохранитьИЗакрыть);
	Параметры.Вставить("ТекстПредупреждения", ТекстПредупреждения);
	
	ИмяПараметра = "СтандартныеПодсистемы.ПараметрыПодтвержденияЗакрытияФормы";
	Если ПараметрыПриложения[ИмяПараметра] = Неопределено Тогда
		ПараметрыПриложения.Вставить(ИмяПараметра, Неопределено);
	КонецЕсли;
	
	ТекущиеПараметры = ПараметрыПриложения["СтандартныеПодсистемы.ПараметрыПодтвержденияЗакрытияФормы"];
	Если ТекущиеПараметры <> Неопределено
	   И ТекущиеПараметры.ОповещениеСохранитьИЗакрыть.Модуль = Параметры.ОповещениеСохранитьИЗакрыть.Модуль Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПриложения["СтандартныеПодсистемы.ПараметрыПодтвержденияЗакрытияФормы"] = Параметры;
	
	Форма.Активизировать();
	ПодключитьОбработчикОжидания("ПодтвердитьЗакрытиеФормыСейчас", 0.1, Истина);
	
КонецПроцедуры

// GRACE:CONTRACT function="ПогаситьВсдОтИмениПолучателя"
Функция ПогаситьВсдОтИмениПолучателя( ДокСсылка ) Экспорт
	
	// LLM_NOTE: Получение параметров организации включает загрузку авторизационных данных (логин, пароль, API-ключ) из безопасного хранилища.
	// Эти параметры используются для HTTP-аутентификации при запросах к ВетИС API.
	мВсдВходящие = Новый Массив;
		
	Организация = ВетИС_ЯдроСервер.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка, "Организация");
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );				
	applicationID = ВетИС_УтилитыКлиентСервер.НайтиApplicationID( ДокСсылка );
	
	ПараметрФункции = Новый Структура();
	ПараметрФункции.Вставить("applicationID", applicationID);
	ПараметрФункции.Вставить("Параметры", ПараметрыОрганизации );
	ПараметрФункции.Вставить("ДокОснование", ДокСсылка );
	ПараметрФункции.Вставить("СделатьПаузу", Ложь );
	ПараметрФункции.Вставить("ВсдРезультатМассив", мВсдВходящие);
	
	// LLM_NOTE: ПолучениеРезультат_ВСД2 отправляет HTTP-запрос к ВетИС API для получения статуса обработки ВСД.
	// Метод реализует цикл опроса с паузами до получения финального статуса (COMPLETED или ERROR).
	Ответ =  ВетИС_APIСервер.ПолучитьРезультат_ВСД2( ПараметрыОрганизации,, applicationID, ДокСсылка, Ложь, мВсдВходящие );	
	
	Если Ответ = ПредопределенноеЗначение("Перечисление.кб99_СтатусЗапроса.COMPLETED") Тогда
		
		ПогаситьВсдОтИмениПолучателяСписком( ДокСсылка, мВсдВходящие );
		
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции

// GRACE:CONTRACT function="ПогаситьВсдОтИмениПолучателяСписком"
Функция ПогаситьВсдОтИмениПолучателяСписком( ДокСсылка, СписокВСД ) Экспорт
	
	мВсдВходящие  = СписокВСД;
		
	ТаблицаВсдДляГашения = Новый Массив;
	
	Для Каждого строкаВсдВходящие Из мВсдВходящие Цикл 
		
		// LLM_NOTE: Гашению подлежат только транспортные ВСД (тип "TRANSPORT"). Фильтрация по типу - требование API ВетИС.
		Если строкаВсдВходящие.ТипВСД <> "TRANSPORT" Тогда 
			Продолжить;
		// LLM_NOTE: Гашение возможно только для ВСД со статусом CONFIRMED. Статусы "В работе" или "Черновик" не подлежат гашению.
		ИначеЕсли строкаВсдВходящие.СтатусВСД <> ПредопределенноеЗначение("Перечисление.кб99_СтатусВСД.CONFIRMED") Тогда 
			Продолжить;
		КонецЕсли;			
		ТаблицаВсдДляГашения.Добавить( строкаВсдВходящие );
		
	КонецЦикла;	
	
	Если ТаблицаВсдДляГашения.Количество()=0 Тогда 
		ВетИС_ЯдроСервер.СообщитьИнфо("Количество ВСД к гашению = "+ТаблицаВсдДляГашения.Количество()+" документы НЕ ПОГАШЕНЫ!");
		возврат Ложь;
	Иначе
		ВетИС_ЯдроСервер.СообщитьИнфо("Количество ВСД к гашению = "+ТаблицаВсдДляГашения.Количество());
	КонецЕсли;
	
	Состояние("Выполняем Гашение ВСД",,"Ожидайте...",БиблиотекаКартинок.kb99_wrench);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТаблицаВсдДляГашения", ТаблицаВсдДляГашения);
	ОрганизацияПолучатель = ВетИС_ЯдроСервер.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка, "ОрганизацияПолучатель");
	СтруктураПараметров.Вставить("Организация", ОрганизацияПолучатель );
	Получатель_ХозСубъект = ВетИС_ЯдроСервер.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка, "Получатель_ХозСубъект");
	СтруктураПараметров.Вставить("Отправитель_ХозСубъект", Получатель_ХозСубъект );
	Получатель_Площадка = ВетИС_ЯдроСервер.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокСсылка, "Получатель_Площадка");
	СтруктураПараметров.Вставить("Отправитель_Площадка", Получатель_Площадка );
	// LLM_NOTE: Открытие формы гашения входящих партий. Форма выполняет гашение ВСД от имени получателя
	// и формирует движения по регистру партий ВетИС.
	ОткрытьФорму("Обработка.кб99_ГашениеВходящихПартий.Форма.ФормаГашениеУФ",СтруктураПараметров,);
	
	ПоказатьОповещениеПользователя("Выполнено");
	
	Возврат Истина;
			
КонецФункции

// GRACE:CONTRACT function="СоздатьИлиОткрытьВСД2"
Процедура СоздатьИлиОткрытьВСД2( ДокОснование ) Экспорт
	
	// Найдем уже созданный
	Организация = ВетИС_ЯдроСервер.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокОснование, "Организация");
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );
	Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"]) Тогда
		Сообщить("Не заполнены параметры для организации "+ Организация);
		Возврат;
	КонецЕсли;
	Если НЕ ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда
		ДокВСД = ВетИС_ЯдроСервер.НайтиВсдТранзакцию( ДокОснование );
		Если ЗначениеЗаполнено(ДокВСД) Тогда
			ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта",Новый Структура("Ключ", ДокВСД));
		Иначе
			ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", Новый Структура("Основание", ДокОснование));
		КонецЕсли;
	Иначе
		ОткрытьФорму("Документ.ВСД2_транзакция.ФормаОбъекта", Новый Структура("Основание", ДокОснование));		
	КонецЕсли;
	
КонецПроцедуры

// GRACE:CONTRACT function="СтруктураСтатусовПартийСОписанием"
Функция СтруктураСтатусовПартийСОписанием() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("_100", 	"Запись создана");
	Результат.Вставить("_101", 	"Запись создана путем гашения ВС (импорт)");
	Результат.Вставить("_102", 	"Запись создана путем гашения ВСД");
	Результат.Вставить("_103", 	"Запись создана в результате производственной операции");
	Результат.Вставить("_104", 	"Запись была создана по справке о безопасности сырого молока");
	Результат.Вставить("_105", 	"Запись была создана после аннулирования ВСД или транзакции, ссылающихся на запись журнала, помеченную для переноса в архив или перенесённую в архив");
	Результат.Вставить("_110", 	"Запись создана в результате объединения двух или более других");
	Результат.Вставить("_120", 	"Запись создана в результате разделения другой");
	Результат.Вставить("_200", 	"В запись были внесены изменения");
	Результат.Вставить("_201", 	"Запись журнала аннулирована");
	Результат.Вставить("_202", 	"Запись продукции изменена путём списания. Необязательно, чтобы продукция была списана полностью, может быть списана и часть объёма");
	Результат.Вставить("_203", 	"Изменена при редактировании производственной операции");
	Результат.Вставить("_204", 	"Запись была обновлена в результате принятия заключения по результатам ВСЭ");
	Результат.Вставить("_230", 	"Запись была обновлена в результате присоединения другой");
	Результат.Вставить("_231", 	"Запись была обновлена в результате присоединения другой");
	Результат.Вставить("_240", 	"Запись была обновлена в результате отделения от неё другой");
	Результат.Вставить("_250", 	"Запись была восстановлена после удаления");
	Результат.Вставить("_300", 	"Запись была перемещена в другую группу (для иерархических справочников)");
	Результат.Вставить("_400", 	"Запись была удалена");
	Результат.Вставить("_410", 	"Запись была удалена в результате объединения");
	Результат.Вставить("_420", 	"Запись была удалена в результате разделения");
	Результат.Вставить("_430", 	"Запись была удалена в результате присоединения"); 
	
	Возврат Результат;
	
КонецФункции

// GRACE:CONTRACT function="СтруктураТочкиМультимодальнойПеревозки"
Функция СтруктураТочкиМультимодальнойПеревозки() Экспорт

	Ответ = Новый Структура;   
	Ответ.Вставить("UUID");
	Ответ.Вставить("НомерСтроки");
	Ответ.Вставить("Площадка");
	Ответ.Вставить("ТипТранспорта");
	Ответ.Вставить("номерАвто");
	Ответ.Вставить("номерКонтейнера");
	Ответ.Вставить("номерПрицепа");
	Ответ.Вставить("номерВагона");
	Ответ.Вставить("НазваниеСудна");
	Ответ.Вставить("НомерАвиарейса");
	Ответ.Вставить("Площадка");
	Ответ.Вставить("Страна");
	Ответ.Вставить("Регион");
	Ответ.Вставить("Район");
	Ответ.Вставить("Город");
	Ответ.Вставить("НаселенныйПункт");
	Ответ.Вставить("Улица");
	Ответ.Вставить("Дом");
	Ответ.Вставить("Строение");
	Ответ.Вставить("Помещение");
	Ответ.Вставить("Название");
	Ответ.Вставить("Перегрузка");
	
	Возврат Ответ;

КонецФункции

// GRACE:CONTRACT function="УстановитьОтборыДинамическихСписковПриОткрытии"
Процедура УстановитьОтборыДинамическихСписковПриОткрытии(Форма) Экспорт
	
	Если Форма.Элементы.Найти("Запросы") <> Неопределено Тогда
		ЭлементОтбора = Форма.дсЗапросы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
		ЭлементОтбора.ПравоеЗначение = Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("дсОстаткиПартий") <> Неопределено Тогда
		ЭлементОтбора = Форма.дсОстаткиПартий.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументДвижения");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
		ЭлементОтбора.ПравоеЗначение = Форма.Объект.Ссылка;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ТаблицаВСД") <> Неопределено Тогда
		ЭлементОтбора = Форма.дсВСД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДокументОснование");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; 
		ЭлементОтбора.ПравоеЗначение = Форма.Объект.Ссылка;
	КонецЕсли;

КонецПроцедуры

// GRACE:CONTRACT function="СоздатьИлиОткрытьКорректировкуВСД"
Процедура СоздатьИлиОткрытьКорректировкуВСД( ДокОснование ) Экспорт
	
	// LLM_NOTE: Поиск существующего документа корректировки ВСД. Если документ уже создан,
	// открывается существующий, иначе создается новый на основании.
	// Проверяем наличие существующего документа
	ДокументКорректировкиВСД = ВетИС_ЯдроСервер.НайтиСуществующийДокументКорректировкаВСД(ДокОснование);
	
	ПараметрыФормы = Новый Структура;
	Если ЗначениеЗаполнено(ДокументКорректировкиВСД) Тогда
		ПараметрыФормы.Вставить("Ключ", ДокументКорректировкиВСД);
	Иначе
		ПараметрыФормы.Вставить("Основание", ДокОснование);
	КонецЕсли;
	
	ОткрытьФорму("Документ.ВСД2_КорректировкаРеализации.ФормаОбъекта", ПараметрыФормы);
		
КонецПроцедуры

// GRACE:CONTRACT function="СоздатьИлиОткрытьПроизводственныйВСД"
Процедура СоздатьИлиОткрытьПроизводственныйВСД( ДокОснование ) Экспорт
	
	Организация = ВетИС_ЯдроСервер.ПолучитьЗначениеРевизитаОбъекта_НаСервере(ДокОснование, "Организация");
	ПараметрыОрганизации = ВетИС_ЯдроСервер.ЗагрузитьПараметры( Организация );

	Если НЕ ЗначениеЗаполнено(ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] ) Тогда
		ВетИС_ЯдроСервер.СообщитьИнфо("Сохраните параметры для Организации " + Организация);
		Возврат;
	КонецЕсли;			
	
	Если НЕ ПараметрыОрганизации["ПарамРазрешитьВводНаОснованииБолееОдногоВСД"] Тогда		
		ДокВСД = ВетИС_ЯдроСервер.НайтиВСД_Производство( ДокОснование );
		Если ЗначениеЗаполнено(ДокВСД) Тогда
			ВетИС_ЯдроСервер.СообщитьИнфо("Уже создан "+ДокВСД, ДокВСД);				
			мНеОткрыватьФормуДокумента = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыОрганизации["ПроизводствоРазбиватьПострочно"] Тогда
		мсДокументов = ВетИС_ПроизводствоСервер.ОформитьПроизводствоПострочно(ПараметрыОрганизации, ДокОснование);
		Для Каждого Документ Из мсДокументов Цикл
			ОткрытьФорму("Документ.ВСД2_Производство.ФормаОбъекта", Новый Структура("Ключ", Документ));	
		КонецЦикла;
	Иначе
		ОткрытьФорму("Документ.ВСД2_Производство.ФормаОбъекта", Новый Структура("Основание", ДокОснование));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьЗначение_СОбработкой(Значение,
											КонтекстОбработчика = Неопределено, 
											ИмяОбработчика = Неопределено,
											ПараметрыОбработчика = Неопределено) Экспорт
	
	ОписаниеОбработчика = Неопределено;
	Если Не ИмяОбработчика = Неопределено И Не КонтекстОбработчика = Неопределено Тогда
		ОписаниеОбработчика = Новый ОписаниеОповещения(ИмяОбработчика, КонтекстОбработчика, ПараметрыОбработчика);
	КонецЕсли;
	ПоказатьЗначение(ОписаниеОбработчика, Значение); 	
	
КонецПроцедуры

// GRACE:MODULE_END name="ВетИС_КлиентскийСлойКлиент"
